Press RETURN to get started!


%LINK-5-CHANGED: Interface FastEthernet0/1, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/1, changed state to up

%LINK-5-CHANGED: Interface FastEthernet0/2, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/2, changed state to up

%LINK-5-CHANGED: Interface FastEthernet0/11, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/11, changed state to up

%LINK-5-CHANGED: Interface FastEthernet0/12, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/12, changed state to up


Switch>
Switch>
Switch>
Switch>
Switch>ena
Switch#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#
Switch(config)#
Switch(config)#hostname ARLETE
ARLETE(config)#VLAN 100
ARLETE(config-vlan)#name ALUMNOS
ARLETE(config-vlan)#VLAN 200
ARLETE(config-vlan)#NAME DOCENTES
ARLETE(config-vlan)#exit
ARLETE(config)#vlan 300
ARLETE(config-vlan)#name ELI
ARLETE(config-vlan)#exit
ARLETE(config)#
ARLETE(config)#
ARLETE(config)#int range fa 0/1-10
ARLETE(config-if-range)#sw
ARLETE(config-if-range)#switchport acc
ARLETE(config-if-range)#switchport access vlan 100
ARLETE(config-if-range)#sw
ARLETE(config-if-range)#switchport mode access
ARLETE(config-if-range)#exit
ARLETE(config)#int range fa 0/11-20
ARLETE(config-if-range)#switchport mode access
ARLETE(config-if-range)#switchport access vlan 200
ARLETE(config-if-range)#exit
ARLETE(config)#int range fa 0/21-23
ARLETE(config-if-range)#switchport mode access
ARLETE(config-if-range)#switchport access vlan 300
ARLETE(config-if-range)#exit
ARLETE(config)#int fa 0/24
ARLETE(config-if)#
ARLETE(config-if)#sw
ARLETE(config-if)#switchport mode trunk
ARLETE(config-if)#exit
ARLETE(config)#do wr
Building configuration...
[OK]
ARLETE(config)#
ARLETE(config)#end
ARLETE#
%SYS-5-CONFIG_I: Configured from console by console

ARLETE#
ARLETE#sh vlan brief

VLAN Name                             Status    Ports
---- -------------------------------- --------- -------------------------------
1    default                          active    Fa0/24
100  ALUMNOS                          active    Fa0/1, Fa0/2, Fa0/3, Fa0/4
                                                Fa0/5, Fa0/6, Fa0/7, Fa0/8
                                                Fa0/9, Fa0/10
200  DOCENTES                         active    Fa0/11, Fa0/12, Fa0/13, Fa0/14
                                                Fa0/15, Fa0/16, Fa0/17, Fa0/18
                                                Fa0/19, Fa0/20
300  ELI                              active    Fa0/21, Fa0/22, Fa0/23
1002 fddi-default                     active    
1003 token-ring-default               active    
1004 fddinet-default                  active    
1005 trnet-default                    active    
ARLETE#
%LINK-5-CHANGED: Interface FastEthernet0/24, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/24, changed state to up









ARLETE con0 is now available






Press RETURN to get started.












%LINK-3-UPDOWN: Interface FastEthernet0/24, changed state to down

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/24, changed state to down

%LINK-5-CHANGED: Interface FastEthernet0/24, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/24, changed state to up


ARLETE>
ARLETE>ena
ARLETE#sh int trunk
Port        Mode         Encapsulation  Status        Native vlan
Fa0/24      on           802.1q         trunking      1

Port        Vlans allowed on trunk
Fa0/24      1-1005

Port        Vlans allowed and active in management domain
Fa0/24      1,100,200,300

Port        Vlans in spanning tree forwarding state and not pruned
Fa0/24      1,100,200,300

ARLETE#








ARLETE con0 is now available






Press RETURN to get started.













ARLETE>
ARLETE>
ARLETE>ena
ARLETE#sh vlan brief

VLAN Name                             Status    Ports
---- -------------------------------- --------- -------------------------------
1    default                          active    
100  ALUMNOS                          active    Fa0/1, Fa0/2, Fa0/3, Fa0/4
                                                Fa0/5, Fa0/6, Fa0/7, Fa0/8
                                                Fa0/9, Fa0/10
200  DOCENTES                         active    Fa0/11, Fa0/12, Fa0/13, Fa0/14
                                                Fa0/15, Fa0/16, Fa0/17, Fa0/18
                                                Fa0/19, Fa0/20
300  ELI                              active    Fa0/21, Fa0/22, Fa0/23
1002 fddi-default                     active    
1003 token-ring-default               active    
1004 fddinet-default                  active    
1005 trnet-default                    active    
ARLETE#