         --- System Configuration Dialog ---

Would you like to enter the initial configuration dialog? [yes/no]: n


Press RETURN to get started!



Router>
Router>
Router>ena
Router#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#
Router(config)#
Router(config)#
Router(config)#int fa 0/0
Router(config-if)#ip add 192.168.100.1 255.255.255.0
Router(config-if)#no sh

Router(config-if)#
%LINK-5-CHANGED: Interface FastEthernet0/0, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/0, changed state to up

Router(config-if)#
Router(config-if)#exit
Router(config)#
Router(config)#
Router(config)#
Router(config)#
Router(config)#
Router(config)#
Router(config)#
Router(config)#int fa 0/0.100
Router(config-subif)#
%LINK-5-CHANGED: Interface FastEthernet0/0.100, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/0.100, changed state to up

Router(config-subif)#enca
Router(config-subif)#encapsulation dot
Router(config-subif)#encapsulation dot1Q 100
Router(config-subif)#ip add 192.168.100.1 255.255.255.0
% 192.168.100.0 overlaps with FastEthernet0/0
Router(config-subif)#
Router(config-subif)#exit
Router(config)#no ip add
                      ^
% Invalid input detected at '^' marker.
	
Router(config)#
Router(config)#
Router(config)#
Router(config)#
Router(config)#
Router(config)#
Router(config)#
Router(config)#end
Router#
%SYS-5-CONFIG_I: Configured from console by console

Router#
Router#
Router#
Router#
Router#
Router#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#int fa 0/0.100
Router(config-subif)#enca
Router(config-subif)#encapsulation dot
Router(config-subif)#encapsulation dot1Q 100
Router(config-subif)#ip add 192.168.100.1 255.255.255.0
% 192.168.100.0 overlaps with FastEthernet0/0
Router(config-subif)#
Router(config-subif)#end
Router#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#interface FastEthernet0/0
Router(config-if)#
%SYS-5-CONFIG_I: Configured from console by console
ip address  
% Incomplete command.
Router(config-if)#shutdown
Router(config-if)#
%LINK-5-CHANGED: Interface FastEthernet0/0, changed state to administratively down

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/0, changed state to down

%LINK-3-UPDOWN: Interface FastEthernet0/0.100, changed state to down

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/0.100, changed state to down

Router(config-if)#
Router(config-if)#
Router(config-if)#exit
Router(config)#
Router(config)#interface FastEthernet0/0
Router(config-if)#
Router(config-if)#exit
Router(config)#
Router(config)#
Router(config)#int fa 0/0.100
Router(config-subif)#enca
Router(config-subif)#encapsulation dot
Router(config-subif)#encapsulation dot1Q 100
Router(config-subif)#ip add 192.168.100.1 255.255.255.0
Router(config-subif)#
Router(config-subif)#
Router(config-subif)#int fa 0/0.200
Router(config-subif)#enca
Router(config-subif)#encapsulation dot
Router(config-subif)#encapsulation dot1Q 200
Router(config-subif)#ip add 192.168.200.1 255.255.255.0
Router(config-subif)#exit
Router(config)#do wr
Building configuration...
[OK]
Router(config)#
Router(config)#interface FastEthernet0/0
Router(config-if)#
Router(config-if)#exit
Router(config)#interface FastEthernet0/1
Router(config-if)#
Router(config-if)#exit
Router(config)#interface FastEthernet0/0
Router(config-if)#no shutdown
Router(config-if)#
%LINK-5-CHANGED: Interface FastEthernet0/0, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/0, changed state to up

%LINK-5-CHANGED: Interface FastEthernet0/0.100, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/0.100, changed state to up

%LINK-5-CHANGED: Interface FastEthernet0/0.200, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/0.200, changed state to up

Router(config-if)#
Router(config-if)#
Router(config-if)#end
Router#
%SYS-5-CONFIG_I: Configured from console by console

Router#
Router#
Router#ena
Router#sh int
FastEthernet0/0 is up, line protocol is up (connected)
  Hardware is Lance, address is 0001.c944.0c01 (bia 0001.c944.0c01)
  MTU 1500 bytes, BW 100000 Kbit, DLY 100 usec,
     reliability 255/255, txload 1/255, rxload 1/255
  Encapsulation ARPA, loopback not set
  Full-duplex, 100Mb/s, media type is RJ45
  ARP type: ARPA, ARP Timeout 04:00:00, 
  Last input 00:00:08, output 00:00:05, output hang never
  Last clearing of "show interface" counters never
  Input queue: 0/75/0 (size/max/drops); Total output drops: 0
  Queueing strategy: fifo
  Output queue :0/40 (size/max)
  5 minute input rate 0 bits/sec, 0 packets/sec
  5 minute output rate 0 bits/sec, 0 packets/sec
     0 packets input, 0 bytes, 0 no buffer
     Received 0 broadcasts, 0 runts, 0 giants, 0 throttles
     0 input errors, 0 CRC, 0 frame, 0 overrun, 0 ignored, 0 abort
     0 input packets with dribble condition detected
     0 packets output, 0 bytes, 0 underruns
     0 output errors, 0 collisions, 2 interface resets
     0 babbles, 0 late collision, 0 deferred
     0 lost carrier, 0 no carrier
 --More-- 

Router#