--- System Configuration Dialog ---

Would you like to enter the initial configuration dialog? [yes/no]: n


Press RETURN to get started!



Router>enable
Router#
Router#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#interface FastEthernet0/0
Router(config-if)#ip address 192.168.5.1 255.255.255.0
Router(config-if)#ip address 192.168.5.1 255.255.255.0
Router(config-if)#no shutdown
Router(config-if)#
%LINK-5-CHANGED: Interface FastEthernet0/0, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/0, changed state to up

Router(config-if)#
Router(config-if)#
Router(config-if)#
Router(config-if)#end
Router#
%SYS-5-CONFIG_I: Configured from console by console

Router#
Router#
Router#
Router#copy ftp running-config
Address or name of remote host []? 192.168.5.5
Source filename []? R11
Destination filename [running-config]? 
Ftp username Or password is not set !, Please set and try again...
Router#
Router#
Router#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#ip ftp username ras1
Router(config)#ip ftp password ras1
Router(config)#
Router(config)#exit
Router#
%SYS-5-CONFIG_I: Configured from console by console

Router#
Router#copy ftp running-config
Address or name of remote host []? 192.168.5.5
Source filename []? R11
Destination filename [running-config]? 

Accessing ftp://192.168.5.5/R11...
[OK - 999 bytes]

999 bytes copied in 0 secs
DHCP#
%SYS-5-CONFIG_I: Configured from console by console

DHCP#
DHCP#