         --- System Configuration Dialog ---

Would you like to enter the initial configuration dialog? [yes/no]: n


Press RETURN to get started!



Router>
Router>ena
Router#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#
Router(config)#host SSH
SSH(config)#int fa 0/0
SSH(config-if)#ip add 192.168.0.1 255.255.255.0
SSH(config-if)#no sh

SSH(config-if)#
%LINK-5-CHANGED: Interface FastEthernet0/0, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/0, changed state to up

SSH(config-if)#exit
SSH(config)#ip domain-name sistemas.com
SSH(config)#cry
SSH(config)#crypto key ge
SSH(config)#crypto key generate rsa
The name for the keys will be: SSH.sistemas.com
Choose the size of the key modulus in the range of 360 to 2048 for your
  General Purpose Keys. Choosing a key modulus greater than 512 may take
  a few minutes.

How many bits in the modulus [512]: 1024
% Generating 1024 bit RSA keys, keys will be non-exportable...[OK]

SSH(config)#
*mar. 2 0:31:25.553: %SSH-5-ENABLED: SSH 1.99 has been enabled
SSH(config)#
SSH(config)#
SSH(config)#ip ssh time-out ?
  <1-120>  SSH time-out interval (secs)
SSH(config)#ip ssh time-out 10
SSH(config)#ip ssh au
SSH(config)#ip ssh authentication-retries ?
  <0-5>  Number of authentication retries
SSH(config)#ip ssh authentication-retries 3
SSH(config)#username PEQUE password 12345
SSH(config)#line vty 0 3
SSH(config-line)#password CISCO
SSH(config-line)#exec-timeout ?
  <0-35791>  Timeout in minutes
SSH(config-line)#exec-timeout 5
SSH(config-line)#trans
SSH(config-line)#transport input ?
  all     All protocols
  none    No protocols
  ssh     TCP/IP SSH protocol
  telnet  TCP/IP Telnet protocol
SSH(config-line)#transport input ssh
SSH(config-line)#login local
SSH(config-line)#exit
SSH(config)#do wr
Building configuration...
[OK]
SSH(config)#