Press RETURN to get started!



Router>
Router>ena
Router#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#hostname R4
R4(config)#
R4(config)#int fa 0/0
R4(config-if)#ip add 192.168.4.1 255.255.255.0
R4(config-if)#no sh

R4(config-if)#
%LINK-5-CHANGED: Interface FastEthernet0/0, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/0, changed state to up

R4(config-if)#
R4(config-if)#int se 0/0/0
R4(config-if)#ip add 2.2.2.2 255.255.255.248
R4(config-if)#no sh

%LINK-5-CHANGED: Interface Serial0/0/0, changed state to down
R4(config-if)#
R4(config-if)#int se 0/0/1
R4(config-if)#ip add 8.8.8.4 255.255.255.248
R4(config-if)#no sh

%LINK-5-CHANGED: Interface Serial0/0/1, changed state to down
R4(config-if)#
R4(config-if)#exit
R4(config)#
R4(config)#int se 0/1/0
R4(config-if)#ip add 3.3.3.3 255.255.255.248
R4(config-if)#no sh

R4(config-if)#
%LINK-5-CHANGED: Interface Serial0/1/0, changed state to up

R4(config-if)#
R4(config-if)#
R4(config-if)#exit
R4(config)#
R4(config)#do wr
Building configuration...
[OK]
R4(config)#
R4(config)#
R4(config)#
%LINEPROTO-5-UPDOWN: Line protocol on Interface Serial0/1/0, changed state to up

R4(config)#
R4(config)#do wr
Building configuration...
[OK]
R4(config)#
R4(config)#
R4(config)#
R4(config)#ip route 192.168.0.0 255.255.255.0 2.2.2.3
R4(config)#ip route 192.168.0.0 255.255.255.0 8.8.8.3
R4(config)#ip route 192.168.0.0 255.255.255.0 3.3.3.4
R4(config)#
R4(config)#ip route 192.168.1.0 255.255.255.0 2.2.2.3
R4(config)#ip route 192.168.1.0 255.255.255.0 8.8.8.3
R4(config)#ip route 192.168.1.0 255.255.255.0 3.3.3.4
R4(config)#
R4(config)#ip route 192.168.2.0 255.255.255.0 2.2.2.3
R4(config)#ip route 192.168.2.0 255.255.255.0 8.8.8.3
R4(config)#ip route 192.168.2.0 255.255.255.0 3.3.3.4
R4(config)#
R4(config)#ip route 192.168.3.0 255.255.255.0 2.2.2.3
R4(config)#ip route 192.168.3.0 255.255.255.0 8.8.8.3
R4(config)#ip route 192.168.3.0 255.255.255.0 3.3.3.4
R4(config)#
R4(config)#do sh ip route
Codes: C - connected, S - static, I - IGRP, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2, E - EGP
       i - IS-IS, L1 - IS-IS level-1, L2 - IS-IS level-2, ia - IS-IS inter area
       * - candidate default, U - per-user static route, o - ODR
       P - periodic downloaded static route

Gateway of last resort is not set

     2.0.0.0/29 is subnetted, 1 subnets
C       2.2.2.0 is directly connected, Serial0/0/0
     3.0.0.0/29 is subnetted, 1 subnets
C       3.3.3.0 is directly connected, Serial0/1/0
     8.0.0.0/29 is subnetted, 1 subnets
C       8.8.8.0 is directly connected, Serial0/0/1
S    192.168.0.0/24 [1/0] via 2.2.2.3
                    [1/0] via 8.8.8.3
                    [1/0] via 3.3.3.4
S    192.168.1.0/24 [1/0] via 2.2.2.3
                    [1/0] via 8.8.8.3
                    [1/0] via 3.3.3.4
S    192.168.2.0/24 [1/0] via 2.2.2.3
                    [1/0] via 8.8.8.3
                    [1/0] via 3.3.3.4
S    192.168.3.0/24 [1/0] via 2.2.2.3
                    [1/0] via 8.8.8.3
                    [1/0] via 3.3.3.4
C    192.168.4.0/24 is directly connected, FastEthernet0/0

R4(config)#
R4(config)#do wr
Building configuration...
[OK]
R4(config)#
R4(config)#