         --- System Configuration Dialog ---

Would you like to enter the initial configuration dialog? [yes/no]: n


Press RETURN to get started!



Router>
Router>ena
Router#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#
Router(config)#hostname R2
R2(config)#int fa 0/0
R2(config-if)#ip add 192.168.1.1 255.255.255.0
R2(config-if)#no sh

R2(config-if)#
%LINK-5-CHANGED: Interface FastEthernet0/0, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/0, changed state to up

R2(config-if)#
R2(config-if)#
R2(config-if)#int se 0/0/0
R2(config-if)#ip add 13.28.0.3 255.255.255.192
R2(config-if)#no sh

R2(config-if)#
%LINK-5-CHANGED: Interface Serial0/0/0, changed state to up

R2(config-if)#
R2(config-if)#int 
%LINEPROTO-5-UPDOWN: Line protocol on Interface Serial0/0/0, changed state to up

               ^
% Invalid input detected at '^' marker.
	
R2(config-if)#
R2(config-if)#int se 0/1/1
R2(config-if)#ip add 13.28.10.4 255.255.255.192
R2(config-if)#no sh

%LINK-5-CHANGED: Interface Serial0/1/1, changed state to down
R2(config-if)#
R2(config-if)#
R2(config-if)#exit
R2(config)#
R2(config)#int se 0/0/1
R2(config-if)#ip add 13.28.2.2 255.255.255.192
R2(config-if)#no sh

%LINK-5-CHANGED: Interface Serial0/0/1, changed state to down
R2(config-if)#
R2(config-if)#exit
R2(config)#
R2(config)#int se 0/1/0
R2(config-if)#ip add 13.28.5.5 255.255.255.192
R2(config-if)#no sh

%LINK-5-CHANGED: Interface Serial0/1/0, changed state to down
R2(config-if)#
R2(config-if)#
R2(config-if)#exit
R2(config)#
R2(config)#
R2(config)#route rip
R2(config-router)#ver 2
R2(config-router)#network 192.168.1.0
R2(config-router)#network 13.28.0.0
R2(config-router)#network 13.28.10.0
R2(config-router)#network 13.28.2.0
R2(config-router)#network 13.28.5.0
R2(config-router)#exit
R2(config)#exit
R2#
%SYS-5-CONFIG_I: Configured from console by console

R2#
R2#wr
Building configuration...
[OK]
R2#
R2#sh ip route
Codes: C - connected, S - static, I - IGRP, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2, E - EGP
       i - IS-IS, L1 - IS-IS level-1, L2 - IS-IS level-2, ia - IS-IS inter area
       * - candidate default, U - per-user static route, o - ODR
       P - periodic downloaded static route

Gateway of last resort is not set

     13.0.0.0/26 is subnetted, 7 subnets
R       13.20.1.0 [120/2] via 13.28.0.2, 00:00:04, Serial0/0/0
C       13.28.0.0 is directly connected, Serial0/0/0
R       13.28.3.0 [120/1] via 13.28.0.2, 00:00:04, Serial0/0/0
R       13.28.4.0 [120/1] via 13.28.0.2, 00:00:04, Serial0/0/0
R       13.28.6.0 [120/2] via 13.28.0.2, 00:00:04, Serial0/0/0
R       13.28.8.0 [120/1] via 13.28.0.2, 00:00:04, Serial0/0/0
R       13.28.9.0 [120/2] via 13.28.0.2, 00:00:04, Serial0/0/0
R    192.168.0.0/24 [120/1] via 13.28.0.2, 00:00:04, Serial0/0/0
C    192.168.1.0/24 is directly connected, FastEthernet0/0
R    192.168.2.0/24 [120/2] via 13.28.0.2, 00:00:04, Serial0/0/0
R    192.168.4.0/24 [120/2] via 13.28.0.2, 00:00:04, Serial0/0/0

R2#